# *_*coding:utf-8 *_*

'''
题目：求0—7所能组成的奇数个数。

一位数的奇数：1，3,5,7（4个）
两位数的奇数：个位只能是1,3,5,7，十位不能为0（6+6+6+6）
三位数的奇数：个位只能是1,3,5,7，十位不能为0（6*6+6*6+6*6+6*6）
四位数的奇数：个位只能是1,3,5,7，十位不能为0（6*6*5+6*6*5+6*6*5+6*6*5）
五位数的奇数：个位只能是1,3,5,7，十位不能为0（6*6*5*4+6*6*5*4+6*6*5*4+6*6*5*4）
六位数的奇数：个位只能是1,3,5,7，十位不能为0（6*6*5*4*3+6*6*5*4*3+6*6*5*4*3+6*6*5*4*3）
七位数的奇数：个位只能是1,3,5,7，十位不能为0（6*6*5*4*3*2+6*6*5*4*3*2+6*6*5*4*3*2+6*6*5*4*3*2）
八位数的奇数：个位只能是1,3,5,7，十位不能为0（6*6*5*4*3*2*1+6*6*5*4*3*2*1+6*6*5*4*3*2*1+6*6*5*4*3*2*1）


'''

def sum(listData):
    a = 0
    b = len(listData) - 2
    A = 1
    B = 0
    C = len(listData) - 1
    for i in listData:
        if i % 2 != 0:
            a += 1    # a为listData中奇数的个数
    print(a)
    for j in range(1, C):
        A *= (C - j)
        print(A)
        B += A
        print(B)
    print(B*b*a + b*a + a)   # b*4为两位数情况下能组成的奇数个数

sum([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])